<?php

return [
	'cant_view_this_page' => 'عفواً .. لا يمكنك عرض هذه الصفحة.',
	'somthing_happening' => 'عفوً .. حدث خطأ ما اعد المحاولة مرة اخرى.',

	'somthing_happening_reload' => 'عفواً .. حدث خطأ ما اعد تحميل الصفحة مرة ثانية.',
	'orders' => [
		'must_rest_program' => 'عفوا! .. تم تغيير عدد الايام بالبرنامج السياحي مما يؤدي الى عدم دقة اعدادات البرنامج.',
	'not_found_prices_dates' => 'لم يتم العثور على اي اسعار مناسبة للأوقات المدخلة.',	
	'not_found_prices' => 'عفوًا .. لم يتم العثور على اي اسعار مناسبة مع البيانات المدخلة.',	
	'required_inputs' => 'تأكد من صحة البيانات المدخلة .. مع الحرص على ملء كافة الخانات التي امامها هذه العلامة (*)',
	'required_hotel_auto_prices' => 'تأكد من اختيار الغرفة ووقت التسجيل بالفندق',	
	'nights_number_less_than_duration' => 'يجب ان لا يزيد عدد اليالي عن المدة المكررة للبرنامج السياحي.',
	'date_less_than_end_date' => 'يجب  ان لا يزيد التاريخ عن قيمة تاريخ انتهاء البرنامج السياحي.',
	'delete_section_alert' => ' <strong>تنبيه!</strong> هذا العنصر تم الغاءه وبالتالي لن  يتم ادراج اي بيانات به داخل البرنامج السياحي.',
	 'required_flight_auto_prices' => 'عفواً ... يجب ملء الحقول الاتية  (من مدينة - الى مدينة - خطوط الطيران - تاريخ الرحلة )',
	 'required_ferry_auto_prices' =>  'عفواً ... يجب ملء الحقول الاتية  (من مدينة - الى مدينة -  تاريخ الرحلة -  العبارة  )',
	 'required_buss_auto_prices' =>  'عفواً ... يجب ملء الحقول الاتية  (من مدينة - الى مدينة -  تاريخ الرحلة )',
	 'required_transport_auto_prices' => 'عفواً ... يجب ملء الحقول الاتية ( مكان المصدر - مكان الهدف - نوع الحافلة - تاريخ الرحلة )',
	 'required_activity_auto_prices' => 'عفواً ... يجب ملء الحقول الاتية  ( المدينة - النشاط - التاريخ )',
	 'required_service_auto_prices' => 'عفواً ... يجب ملء الحقول الاتية  ( المدينة - الخدمة - التاريخ )',
	 	 	 'alert_type_name' => ['error' => 'خطأ', 'warning' => 'تحذير', 'note' => 'ملحوظة', 'info' => 'تنوية'],
	 	'alert_financial_has_commission' => 'هذه العمولة عن العملية المالية رقم  [:no] والتي قيمتها تساوي [:value]',


	 	


	],

	'financials' => [

		'account_not_have_credit_to_refund' => 'عفواً الحساب رقم :no ليس به رصيد كافي لاسترجاع قيمة العملية الحسابية, لذلك لن تستطيع استكمال طلبك..', 	
		

	],

];