
<?php

return [

    'permissions' => [
        'access' => 'عفوا ليس لديك صلاحية الوصول هذة الصفحة',
    ],

    'investor'=>[
        'total_account'=>'عفوا لا يوجد لديك رصيد كافى',
        'create'=> 'تم اضافة مستثمر جديد',
        'company_account'=>':name الرصيد الافتتاحى لهذا المستسمر, ',
        'total_account_check'=> 'دفعه الرصيد الافتتاحيه يجب ان لا تكون اصغر من الصفر',
        'Financial'=> ' ايداع رصيد افتتاحى قيمتة :amount  ريال سعودى , الى/ :name ',
        'update'=>'تم تعديل البيانات بنجاح',
        'delete'=>'تم حذف المستثمر بنجاح',
        'main_investor'=>'لا يمكن حذف المستثمر الرئيسي',
        'notes'=>'تم حفظ الملاحظات بنجاح',
    ],

    'deposit'=>[
        'Financial'=> ' ايداع مبلغ نقدى قيمتة :amount  ريال سعودى , الى/ :name ',
        'create'=>'تم تنفيذ عمليه الايداع بنجاح',
        'check_money'=>'عفوا لا يوجد لديك رصيد كافى',
    ],

    'pull'=>[
        'Financial_company'=> ' سحب من اجل مصروفات الشركه مبلغ نقدى قيمتة :amount  ريال سعودى , من/ :name ',
        'Financial_investor'=> ' سحب مبلغ نقدى قيمتة :amount  ريال سعودى , من/ :name ',
        'create'=>'تم تنفيذ عمليه السحب بنجاح',
        'check_money'=>'عفوا الرصيد المتاح اقل من المبلغ المطلوب',
    ],

    'transfer'=>[
        'Financial'=> ' تم تحويل مبلغ نقدى قيمته :amount  ريال سعودى , من/ :name  الى/ :name_2 ',
        'create'=>'تم تنفيذ عمليه التحويل بنجاح',
        'check_money'=>'عفوا الرصيد المراد تحوليه غير كافى فى رصيد المستثمر الاول',
    ],

    'client'=>[
        'create'=> 'تم اضافة عميل جديد',
        'update'=>'تم تعديل البيانات بنجاح',
        'delete'=>'تم حذف العميل بنجاح',
        'notes'=>'تم حفظ الملاحظات بنجاح',
    ],

    'store'=>[
        'Financial'=> ' تم سحب مبلغ نقدى قيمته/ :amount  ريال سعودى , من/ :name  قيمه شراء/ :product عدد/ :number',
        'create'=> 'تم تنفيذ العمليه بنجاح',
        'check_amount'=>'عنصلر الكميه والسعر لا يمكن ان يكون اقل من 0',
        'check_money'=>'عفوا رصيدك غير كافى',
        'delete'=>'تم حذف المنتج بنجاح',
    ],

    'contract'=>[
        'first_payment_mot_less_commission' => 'يجب ان لا تقل قيمة المبلغ المدفوع عن قيمة العمولة الموضوعة على القسط والتي تساوي ( :amount ) ريال سعودي',
        'Financial'=> ' دفعة مقدمة بمبلغ/ :amount  ريال سعودى , من/ :name الى/ :name_2 ',
        'create'=> 'تم اضافة عقد جديد يرجا المراجعه ثم التاكيد',
        'save'=> 'تم حفظ عقد جديد بنجاح',
        'check_last_premium'=>'قيمه العموله لا بد ان تكون اقل من قيمه اخر قسط',
        'check_product'=>'يجب اختيار سلعه واحده على الاقل && قيمه العقد لا يمكن ان تكون فارغة',
        'check_amount'=> 'هذه الكميه غير متوفره',

        'sponsor_edit'=> 'تم تعديل الكفيل',
        'fees'=> 'تم تعديل الرسوم الادارية',
        'profit'=> 'تم تعديل العمولة',
        'group'=> 'تم تعديل المجموعه',
        'date_check'=> 'عفوا صيغه التاريخ غير مدعومه',
        'date_edit'=> 'تم تعديل التاريخ',
        'premium_date'=> 'عنصر التاريخ لا يمكن ان يكون فرغا',
        'premium_amount'=> 'عنصر المبلغ لا يمكن ان يكون فرغا',

        'premium_edit'=> 'تم تعدل الاقساط بنجاح',
        'premium_check'=> 'عفوا المجموع يجب ان يكون متساوى مع المتبقى فى العقد',
        'premiums_pay_check_order'=> 'عفوا يجب اختيار القسط',
        'premium_pay_check_amount'=>'عفوا المدفوع اكبر من المطلوب سداده',
        'premium_Financial'=> '  سداد من العميل :name الى/ :name_2  مبلغ وقدره/ :amount  ريال سعودى ',
        'premium_pay'=>'تم دفع قيمه القسط بنجاح',
        'conflict'=>'تم حفظ العقد فى العقود المتعثره',
        'issue'=>'تم حفظ العقد فى العقود ذات قضية',
        'finish'=>'تم  مخالصه العقد بنجاح',
        'finish_Financial'=> '  سداد عقد بمبلغ :amount ريال سعودى من/ :name الى :name_2 ',
        'contract_financial'=> '  تم خصم من المستثمر :investor مبلغ :amount ضمن عمولة عقد رقم  :contract',
        'notes'=> 'تم حفظ الملاحظة بنجاح',

        'delete'=>'تم حذف العقد بنجاح',
        'error_delete_first_payment'=>'عفواَ الحساب الذي اخترته غير كافي لخصم مقدار الدفعة الأولى',
         'error_not_fount_account'=> "عفوا حساب :account غير متاح",
          'error_delete_commission_payment'=>'عفواَ الحساب الذي احترته غير كافي لخصم مقدار العمولة المدفوعة لهذا العقد',
        'error_delete_premium_payment'=>'عفواَ الحساب الذي احترته غير كافي لخصم مقدار الدفعات المقدمة لسداد اقساط هذا العقد',
        'error_delete_fees_payment'=>'عفواَ الحساب الذي احترته غير كافي لخصم مقدار قيمة الرسوم  الادارية لهذا العقد',
        

         
        
    ],

    'categories'=>[
        'create'=> 'تم اضافة تصنيف جديد',
        'update'=>'تم تعديل التصنيف بنجاح',
        'delete'=>'تم حذف التصنيف بنجاح',
    ],

    'products'=>[
        'create'=> 'تم اضافة منتج جديد',
        'update'=>'تم تعديل المنتج بنجاح',
        'delete'=>'تم حذف المنتج بنجاح',
    ],

    'bank_accounts'=>[
        'create'=> 'تم اضافة حساب جديد',
        'update'=>'تم تعديل الحساب بنجاح',
    ],

    'groups'=>[
        'create'=> 'تم اضافة مجموعة جديد',
        'update'=>'تم تعديل المجموعة بنجاح',
    ],

    'collections'=>[
        'create'=> 'تم حفظ الملاحظه',
    ],

    'targets'=>[
        'create'=> 'تم اضافه بند جديد',
    ],

    'users'=>[
        'create'=> 'تم اضافة عضو جديد',
        'update'=>'تم تعديل البيانات بنجاح',
        'delete'=>'تم حذف العضو بنجاح',
        'password_edit'=>'تم تعديل كلمه المرور بنجاح',
        'password_check'=>'عفوا كلمه المرور الحاليه غير صحيحه',
    ],


];